---
kind: other
id: Methods.T:Autodesk.Revit.DB.Architecture.StairsRun
source: html/b594f8e4-829a-2596-e0c5-2128d0d9510e.htm
---
# StairsRun Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.